# ZoneWithoutSpacesWarn Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..EnergyAnalysisFailures..::..ZoneWithoutSpacesWarn Property
BuiltInFailures..::..EnergyAnalysisFailures Class See Also
---
This zone has no spaces.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ZoneWithoutSpacesWarn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ZoneWithoutSpacesWarn As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ZoneWithoutSpacesWarn {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..EnergyAnalysisFailures Class
Autodesk.Revit.DB Namespace